[
  {
    "title": "FightMetricsAI: UFC Prediction Platform with Ensemble ML & RAG",
    "date": "Summer 2025",
    "role": "Full-Stack ML Engineer & Data Pipeline Architect",
    "description": "Built a comprehensive UFC prediction platform combining ensemble machine learning with RAG-powered sentiment analysis and a full-stack web application, processing 60,000+ UFC data points for enhanced fight outcome predictions.",
    "details": [
      "Ensemble ML system with XGBoost, CatBoost, Logistic Regression, and PyTorch MLP using Out-of-Fold stacking for superior prediction accuracy",
      "Real-time RAG pipeline with LangChain and OpenAI GPT-4 for sentiment analysis and fight context validation",
      "Full-stack React/Flask web app with prediction dashboard, fighter database, and real-time streaming updates"
    ],
    "tech": [
      "Python", "React", "Flask", "PyTorch", "XGBoost", "CatBoost", "LangChain", 
      "OpenAI GPT-4", "FAISS", "Playwright", "MySQL", "Ensemble ML",
      "RAG Pipeline"
    ],
    "projectLink": "https://fightmetricsai.onrender.com",
    "githubLink": "https://github.com/adamwalid64/FightMetricsAI"
  },
  {
    "title": "Purchase Pulse: Customer Repurchase Prediction Dashboard",
    "date": "Spring 2025",
    "role": "Data Science & Full-Stack Developer",
    "description": "Developed a full-stack machine learning web application to predict customer repurchase behavior. Combined a Python-based logistic regression model with an interactive React.js + Flask dashboard, enabling actionable insights for marketing teams.",
    "details": [
      "Integrated frontend inputs with backend ML inference via REST APIs",
      "Designed a responsive UI using Bootstrap, Recharts, and CSS to visualize predictions and model performance",
      "Engineered SQL-derived features and interaction terms, optimized binary cross-entropy loss via gradient descent, and achieved high prediction accuracy on a Kaggle dataset"
    ],
    "tech": ["Python", "Flask", "React.js", "Bootstrap", "Recharts", "SQL", "Gradient Descent"],
    "projectLink": "https://adamwalid64.github.io/PurchasePulseAI/",
    "githubLink": "https://github.com/adamwalid64/PurchasePulseAI"
  },
  {
    "title": "NFL Fantasy RAG Pipeline: AI-Powered Fantasy Football Assistant",
    "date": "Summer 2025",
    "role": "AI Engineer & Data Scientist",
    "description": "Developed an intelligent NFL fantasy football draft assistant using Retrieval-Augmented Generation (RAG) to provide real-time, data-driven draft recommendations. The system combines web scraping, NLP, and AI to analyze current NFL news and deliver personalized draft strategies.",
    "details": [
      "Advanced RAG-Powered Draft Assistant: Retrieval-Augmented Generation system using OpenAI GPT-4 and FAISS that generates personalized draft strategies and risk assessments",
      "Production-Ready AI Infrastructure: Built-in cost optimization, multi-source validation, and scalable data pipeline for handling thousands of articles",
      "Real-time NFL Data Intelligence: Web scraping system that continuously collects and processes NFL news, injury reports, and fantasy rankings"
    ],
    "tech": ["OpenAI GPT-4", "LangChain", "FAISS", "OpenAI Embeddings API", "Python", "BeautifulSoup", "Playwright"],
    "projectLink": "https://github.com/adamwalid64/NFL-RAG-LLM",
    "githubLink": "https://github.com/adamwalid64/NFL-RAG-LLM"
  }
]
